
INSERT INTO `base_video` VALUES ('1', '线性代数的本质＃5：三维线性变换', '', '', 0, 0, '三维的线性变换看起来像什么？在先前我们已经谈过矩阵与线性变换之间的关系，而这部影片我们会将同样的概念扩张到三维的情况。', 0, '2019-07-01 06:37:25.648195', NULL);
INSERT INTO `base_video` VALUES ('2', '微积分的本质＃3：用几何求得导数公式', '', '', 0, 0, '以几何的直觉推导一些求导数公式，像求幂规则和sine的导数看一下Brilliant:', 0, '2019-07-03 09:13:32.917379', NULL);
INSERT INTO `base_video` VALUES ('3', '线性代数的本质＃13：基向量转换', '', '', 0, 0, '如何在使用不同基向量的坐标系之间来回转换？', 0, '2019-07-03 06:13:12.358001', NULL);
INSERT INTO `base_video` VALUES ('4', '线性代数的本质＃4：作为合成的矩阵乘法', '', '', 0, 0, '将两个矩阵相乘事实上是表示将一个变换套用在另一个变换上。如果能了解这个概念，会对于矩阵乘法的许多性质更能清楚理解。', 0, '2019-07-01 06:33:59.290468', NULL);
INSERT INTO `base_video` VALUES ('5', '微积分的本质＃1：预览', '', '', 0, 0, '我希望各位能够感觉到自己其实有能力发明微积分。在这系列的第一段影片，我们看到如何从一个简单的几何问题，透过解开当中最深入的部分，而得出积分、导数、以及微积分最基本的定理。', 0, '2019-07-03 07:48:40.424075', NULL);
INSERT INTO `base_video` VALUES ('6', '计算机科学速成课＃5：计算机如何计算 - ALU', '', '', 0, 0, '今天我们要讨论所有现代计算机的基本部分。基本上所有其他东西使用的东西 - 算术和逻辑单元（或ALU）。 ALU可能没有最令人兴奋的名字，但它是计算机的数学大脑，负责计算机的所有计算！它实际上并没有那么复杂。因此，今天我们将使用我们在之前的剧集中学到的二进制和逻辑门来从头开始构建一个，然后在第7集中构建计算机的核心CPU时，我们将使用新创建的ALU。\r\n*更正*\r\n我们将电线与英特尔4004交叉，我们稍后会讨论。 74181由德州仪器于1970年推出，但在1969年左右出现在技术手册中.74181的设计与大多数74xx / 74xxx系列一样，是由许多其他公司制造的开放式设计 - 飞兆半导体就是这样的制造商之一。他们生产了一款芯片，即Fairchild 9341，它与74181引脚兼容。\r\n飞兆半导体率先推出ALU原型机，于1968年制造了Fairchild 4711--这是一款未针对规模制造进行优化的一次性设备。 1969年，Signetics推出了8260，它们以非常有限的方式销售（它附属于AFAICT，一台特定的计算机，数据通用SUPERNOVA）。 TI随后（1970年3月）跟随74181，再加上Fairchild的9341。 74181成为该部件的标准编号，并且可以从许多制造商处获得（当时，芯片制造商在各地交叉许可设计，以确保他们的部件可以来自多个制造商）。', 0, '2019-07-01 06:05:25.532549', NULL);
INSERT INTO `base_video` VALUES ('7', '线性代数的本质＃7：反矩阵、行空间与零空间', '', '', 0, 0, '要如何用几何的方式来思考线性方程组呢？这部影片主要聚焦在反矩阵、行空间、秩与零空间概念上的直觉，而不会讨论如何计算。', 0, '2019-07-03 00:39:40.485381', NULL);
INSERT INTO `base_video` VALUES ('8', '线性代数的本质＃10：外积', '', '', 0, 0, '这部影片包含在二维与三维外积背后的几何直觉。\r\n※注意的是，在影片中的计算我们都将向量以行矩阵表示，但许多教科书则用列矩阵表示。由于行列式在转置后不变，这对于计算结果不会有差异，但我认为以行矩阵来表示是比较能产生直觉的', 0, '2019-07-03 02:09:36.309352', NULL);
INSERT INTO `base_video` VALUES ('9', '微积分的本质＃8：积分和微积分的基本定理', '', '', 0, 0, '什么是积分？你觉得怎么样？', 0, '2019-07-04 03:38:47.690689', NULL);
INSERT INTO `base_video` VALUES ('10', '线性代数的本质＃2：线性组合、生成空间与基底向量', '', '', 0, 0, '基础的向量概念，包括生成空间、线性组合、线性相依与基底，都是基于一种重要的操作：将许多向量伸缩后相加。', 0, '2019-07-01 06:24:21.731146', NULL);
INSERT INTO `base_video` VALUES ('11', '微积分的本质＃11：泰勒系列', '', '', 0, 0, '泰勒多项式对于逼近是非常强大的，泰勒级数可以提供新的方法来表示函数。', 0, '2019-07-04 07:21:32.119890', NULL);
INSERT INTO `base_video` VALUES ('12', '计算机科学速成课＃4：用二进制代表数字和字母', '', '', 0, 0, '今天，我们将看看计算机如何使用1和0流代表我们的所有数据 - 从短信和照片到音乐和网页。我们将专注于如何使用这些二进制值来表示数字和字母，并讨论我们如何在更大和更复杂的值上执行操作，将我们从8位视频游戏带到漂亮的Instagram【照片墙（一款图片分享应用）】照片，以及从不可读的我们的电子邮件中的文本乱码为通用语言编码方案。', 0, '2019-07-01 05:48:31.382414', NULL);
INSERT INTO `base_video` VALUES ('13', '线性代数的本质＃9：内积与对偶', '', '', 0, 0, '内积是一个很好了解投影的几何工具。现在我们了解线性变换之后，就能对于内积究竟是什么，以及其数值计算与几何解释之间的关联有更深刻的感觉。', 0, '2019-07-03 01:33:20.633199', NULL);
INSERT INTO `base_video` VALUES ('14', '微积分的本质＃7：“无穷小分析”，洛必达法则', '', '', 0, 0, '形式衍生物，“无穷小分析”定义，以及洛必达法则的工作原理。', 0, '2019-07-04 03:05:04.640184', NULL);
INSERT INTO `base_video` VALUES ('15', '线性代数的本质＃11：基于线性变换的外积', '', '', 0, 0, '这部影片针对想更深入了解外积的人，藉由对偶展示外积与线性变换的关系。这个观点优雅地解释了内积的传统计算方式是如何与其几何解释产生连结的。※注意的是，在影片中的计算我们都将向量以行矩阵表示，但许多教科书则用列矩阵表示。由于行列式在转置后不变，这对于计算结果不会有差异，但我认为以行矩阵来表示是比较能产生直觉的。', 0, '2019-07-03 02:49:11.549801', NULL);
INSERT INTO `base_video` VALUES ('16', '线性代数的本质＃3：线性变换与矩阵', '', '', 0, 0, '矩阵可以被想像成是一种空间的转换，了解这个概念对于往后许多线性代数的观念是相当重要的。', 0, '2019-07-01 06:27:10.836021', NULL);
INSERT INTO `base_video` VALUES ('17', '计算机科学速成课＃3：布尔逻辑和逻辑门', '', '', 0, 0, '今天，Carrie Anne将看看我们上次谈论的那些晶体管如何用于执行复杂的动作。只有两个状态，开启和关闭，电流可用于执行许多逻辑操作，这些操作由称为布尔代数的数学分支引导。我们将重点关注三个基本操作 -  NOT，AND和OR  - 并展示它们是如何在一系列非常有用的电路中创建的。它的这些简单的电路为我们更复杂的机器奠定了基础。\r\n*修正* 1:27图表显示“五进制体系”，但图表显示了10种可能的状态 - 实际上是十进制状态。从技术上讲，那里应该只有5个可能的值，但整体概念仍然相同。', 0, '2019-07-01 03:53:51.410016', NULL);
INSERT INTO `base_video` VALUES ('18', '微积分的本质＃12：学校不会教你的微积分', '', '', 0, 0, '衍生物的視覺，更好地推廣到微積分以外的主題。', 0, '2019-07-04 07:37:29.457773', NULL);
INSERT INTO `base_video` VALUES ('19', '微积分的本质＃6：隐函数微分，这是怎么回事?', '', '', 0, 0, 'implicit differentiation can feel weird, but what\'s going on makes much more sense once you view each side of the equation as a two-variable function, f(x, y).', 0, '2019-07-04 02:12:48.738617', NULL);
INSERT INTO `base_video` VALUES ('20', '线性代数的本质＃14：特征向量和特征值', '', '', 0, 0, '如何在使用不同基向量的坐标系之间来回转换？', 0, '2019-07-03 06:30:10.897593', NULL);
INSERT INTO `base_video` VALUES ('21', '计算机科学速成课＃1：早期计算机', '', '', 0, 0, '大家好！ 欢迎来到计算机科学速成课程！今天，我们将看看计算的起源，因为我们的数字计算机相对较新，但计算的需求并非如此。 自文明本身开始以来，人类对特殊设备的需求越来越大，以帮助管理繁重的任务，随着社会规模的不断扩大，这些计算设备开始在扩大我们的心理能力方面发挥着至关重要的作用。 从算盘和星盘到差异引擎和制表机，我们已经有很长的路要走，以满足这种日益增长的需求，并在此过程中完全改变了商业，政府和日常生活。', 0, '2019-07-01 03:49:35.501341', NULL);
INSERT INTO `base_video` VALUES ('22', '微积分的本质＃9：区域与斜坡有什么关系', '', '', 0, 0, '积分是用来求连续变量的平均值的，这就解释了为什么积分和导数是逆变换，和上个视频中展示的不同。', 0, '2019-07-04 06:38:28.630662', NULL);
INSERT INTO `base_video` VALUES ('23', '线性代数的本质＃1：向量，到底是什么？', '', '', 0, 0, '我想许多人在某些背景下对向量已经对向量相当熟悉，所以这部影片打算对向量相关的术语进行快速的复习，并让我们能用线性代数的思考方式来想像向量。', 0, '2019-07-01 06:17:54.208039', NULL);
INSERT INTO `base_video` VALUES ('24', '线性代数的本质＃8：非方阵的矩阵，在不同维度间的转换', '', '', 0, 0, '由于有人询问，于是就做了这部影片来简单呈现非方阵的矩阵在不同维度间转换的几何解释', 0, '2019-07-03 01:25:36.466289', NULL);
INSERT INTO `base_video` VALUES ('25', '微积分的本质＃10：高级衍生物', '', '', 0, 0, '对二阶导数，三阶导数等的快速入门。', 0, '2019-07-04 06:59:50.470341', NULL);
INSERT INTO `base_video` VALUES ('26', '微积分的本质＃4：链式法则和乘积法则的形象化', '', '', 0, 0, '直观地解释链式法则和乘积法则是什么，以及为什么它们是正确的。', 0, '2019-07-04 01:09:49.275636', NULL);
INSERT INTO `base_video` VALUES ('27', '计算机科学速成课＃0：预览', '', '', 0, 0, 'Carrie Anne Philbin将主持速成计算机科学课程！在本系列中，我们将追溯现代计算机的起源，仔细研究为我们提供当前硬件和软件的想法，讨论我们的智能设备如何以及为何变得更加智能，甚至展望未来！计算机在我们社会的功能中扮演着至关重要的角色，我们希望在本系列课程中您将更好地了解计算机带我们走多远以及它们可以带我们走多远。', 0, '2019-07-01 03:47:25.254738', NULL);
INSERT INTO `base_video` VALUES ('28', '线性代数的本质＃15：抽象矢量空间', '', '', 0, 0, '如何在使用不同基向量的坐标系之间来回转换', 0, '2019-07-03 06:56:42.724013', NULL);
INSERT INTO `base_video` VALUES ('29', '计算机科学速成课＃2：电子计算', '', '', 0, 0, '我们在20世纪初用Herman Hollerith的制表机等专用计算设备结束了上一集。\r\n但随着人类文明规模的不断扩大，对更复杂，更强大的设备的需求也在不断增长。很快，这些机柜大小的机电计算机将成长为容易出错的，房间大小的庞然大物。但这些计算机是否有助于开启计算的新时代 - 电子计算呢？', 0, '2019-07-01 03:52:43.013136', NULL);
INSERT INTO `base_video` VALUES ('30', '微积分的本质＃2：衍生物的悖论', '', '', 0, 0, '衍生品以瞬间变化的观念为中心，但变化发生在一段时间内，而瞬间只有一瞬间。这是如何运作的？\r\n请注意，为了说明我对新的微积分学生的目标受众的观点，我讨论了一个假设的速度计，它可以在很短的时间内进行距离测量。有趣的是，现代汽车中的大多数实际速度表都是通过分析旋转磁体的感应电流来工作的，这在某种意义上说是宇宙实现了导数。', 0, '2019-07-03 08:17:27.782058', NULL);
INSERT INTO `base_video` VALUES ('31', '线性代数的本质＃6：行列式', '', '', 0, 0, '一个线性变换的行列式是用来度量在变换中面积（或体积）所改变的程度。', 0, '2019-07-03 00:37:49.902270', NULL);
INSERT INTO `base_video` VALUES ('32', '线性代数的本质＃12：Cramer的规则，几何解释', '', '', 0, 0, '对于许多学生来说，这条规则似乎是随机的，但它有一个美好的理由。', 0, '2019-07-03 03:17:44.424035', NULL);
INSERT INTO `base_video` VALUES ('33', '微积分的本质＃5：欧拉数e有什么特别之处?', '', '', 0, 0, 'e是什么?为什么指数与它们自己的导数成比例?', 0, '2019-07-04 01:34:40.856290', NULL);

INSERT INTO `course_problemset` VALUES (1, '看待向量的观点有几种？#A.1#B.2#C.3#D.4', 2, 2);
INSERT INTO `course_problemset` VALUES (2, '以下说法错误的是？#通过改变所选择2个标量，你可以到达屏幕中的每一个点#每当我们用数字描述向量时，它都依赖于我们正在使用的基#不管多少个向量都最好看作箭头#空间的一组基的严格定义是：张成该空间的一个线性无关向量的集合', 2, 2);

